SigninLogs 
    | where TimeGenerated > ago(30m) 
    | project 
        Category,
        TimeGenerated,
        OperationName,
        UserDisplayName,
        Identity,
        UserPrincipalName,
        AppDisplayName,
        AppId,
        ResourceDisplayName,
        AuthenticationDetails,
        AuthenticationProcessingDetails,
        ConditionalAccessPolicies,
        DeviceDetail