SigninLogs 
    | where TimeGenerated > ago(60m) 
    | project 
        UserDisplayName,
        Identity,
        UserPrincipalName,
        AppDisplayName,
        AppId,
        ResourceDisplayName